In [1]:
import numpy as np
import pandas as pd

In [2]:
dic = {"name":["CODEX CODER","CODEX","PRINCE","PRINCE SINGH"],
      'marks':[90,65,80,86],
      'city':["mp",'gujrat','bihar','madhya pradesh']}

In [3]:
data = pd.DataFrame(dic)

In [4]:
data

           name  marks            city
0   CODEX CODER     90              mp
1         CODEX     65          gujrat
2        PRINCE     80           bihar
3  PRINCE SINGH     86  madhya pradesh

In [5]:
#convert data in ecel file
data.to_csv('result data.csv')

In [6]:
data

           name  marks            city
0   CODEX CODER     90              mp
1         CODEX     65          gujrat
2        PRINCE     80           bihar
3  PRINCE SINGH     86  madhya pradesh

In [7]:
# i want to no serial no or index
data.to_csv('with out index result data.csv')

In [8]:
# i want to no serial no or index
data.to_csv('with out index result data.csv',index=False)

In [9]:
# i want to show only starting 2 rows
data.head(2)

          name  marks    city
0  CODEX CODER     90      mp
1        CODEX     65  gujrat

In [10]:
data.head(1)

          name  marks city
0  CODEX CODER     90   mp

In [11]:
# i want to show only end 2 rows
data.tail(1)

           name  marks            city
3  PRINCE SINGH     86  madhya pradesh

In [12]:
# data descrive
data.describe()

           marks
count   4.000000
mean   80.250000
std    10.965856
min    65.000000
25%    76.250000
50%    83.000000
75%    87.000000
max    90.000000

In [13]:
# read data
read_data = pd.read_csv('TRAIN DATA.csv')

In [14]:
read_data

   Train No               name  Price Status
0      5510  Indore exp bhopal   1500     NO
1      3050   bhopal intercity   1620    YES
2      5460        gkp express   2100    YES
3      9405    ind gwalior exp   3900     NO

In [15]:
# excess data by index,row,collom
read_data['name']

0    Indore exp bhopal
1     bhopal intercity
2          gkp express
3      ind gwalior exp
Name: name, dtype: object

In [16]:
read_data['Price']

0    1500
1    1620
2    2100
3    3900
Name: Price, dtype: int64

In [17]:
read_data

   Train No               name  Price Status
0      5510  Indore exp bhopal   1500     NO
1      3050   bhopal intercity   1620    YES
2      5460        gkp express   2100    YES
3      9405    ind gwalior exp   3900     NO

In [18]:
# change index
read_data.index=['first','second','thord','fourth']

In [19]:
read_data

        Train No               name  Price Status
first       5510  Indore exp bhopal   1500     NO
second      3050   bhopal intercity   1620    YES
thord       5460        gkp express   2100    YES
fourth      9405    ind gwalior exp   3900     NO

In [20]:
for i in read_data:
    print(i)

Train No
name
Price
Status